armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32F3xx_DFP</name>
  <description>STMicroelectronics STM32F3 Series Device Support and Examples</description>

  <releases>
    <release version="2.1.0" date="2018-01-16">
      This DFP works either with STM32CubeMX (STM32CubeMX V4.23.0 and STM32Cube_FW_F3 V1.9.0 or higher)
      or Standalone (no support for STM32CubeMX). STM32CubeMX is mandatory for use of CMSIS-Driver and MDK-Middleware.
      This packs contains a subset of the files from STM32Cube_FW_F3 version 1.9.0  (Drivers, STCube documentation and fonts).
      Updated documentation for STM32Cube Framework usage.
      - New projects require the component 'Device:STM32Cube Framework:STM32CubeMX' for configuration of pins and clocks via STM32CubeMX.
      Device support:
      - Removed devices not being supported by STM32CubeMX 4.23.0 (STM32F301C6Yx, STM32F301K6Tx).
      - Added DBGMCU INI files for use with debug adapter that lack support for debug descriptions.
      Board support:
      - Added Board Support Interfaces for STM32303S-EVAL board and example projects.
      Example projects:
      - Added emWin example for STM32303E-EVAL.
      - Added example projects for STM32303S-EVAL.
      - Updated all examples separating output folder for each target: "Debug" output folder "Debug" target, "Release" output folder for "Release" target.
    </release>
    <release version="2.0.0" date="2017-11-13">
      This DFP requires STM32CubeMX V4.23.0 and STM32Cube_FW_F3 V1.9.0 or higher to be installed.
      This packs contains a subset of the files from STM32Cube_FW_F3 version 1.9.0  (Drivers, STCube documentation and fonts).
      Updated documentation for STM32Cube Framework usage.
      - New projects require the component 'Device:STM32Cube Framework:STM32CubeMX' for configuration of pins and clocks.
      Updated Device names:
      - Device names now match STM32CubeMX database specifying the device package.
      - Updated device documentation.
      CMSIS Driver:
      - Added CAN driver.
      - Added I2C driver.
      - Added SPI driver.
      - Added UART/USART driver.
      - Added USB Device driver.
      Board support:
      - Added Board Support Interfaces for STM32303C-EVAL, STM32373C-Eval, STM32F3-Discovery and STM32F334-Discovery Boards.
      Example projects:
      - Added CMSIS-RTOS2 Blinky, CAN, FileSystem, USB Device MassStorage, USB Device HID
      Added BSP drivers for generic CubeMX targets: LED, Buttons.
    </release>
    <release version="1.4.0" date="2017-02-06">
      Added STM32F334-Discovery basic board support and blinky RTX5 example.
      Reworked STM32F3xx_OPT.s.
      Updated SVD file STM32F334x.svd adding missing registers for ADC2.
    </release>
    <release version="1.3.0" date="2015-03-02">
      Added devices: STM32F302xE, STM32F302xD, STM32F303xE, STM32F303xD.
      Added device STM32F398VE.
      Added device feature description.
      Updated device support files.
      Updated reference manuals, datasheets, errata sheets.
      Reworked 'Conditions', 'Component Startup'.
    </release>
    <release version="1.2.0" date="2014-11-18">
      Fixed device define for STM32F301 devices from "STM32F301x8" to "STM32F302x8"
      Updated STM32373C-EVAL GLCD board support files.
      Updated STM32373C-EVAL board description.
    </release>
    <release version="1.1.0" date="2014-10-01">
      Device Support for STM32F301, STM32F302, STM32F303, STM32F3x4, STM32F3x8 and STM32F373 Device Subfamilies
      - based on STM32F30x_DSP_StdPeriph_Lib_V1.2.0 and STM32F37x_DSP_StdPeriph_Lib_V1.0.0
      Added: Board description, Board support for
      - STMicroelectronics STM32F3-Discovery, STM32373C-EVAL and STM32303C-EVAL
    </release>
    <release version="1.0.1">
      Updated: Device descriptions updated with features
    </release>
    <release version="1.0.0">
      First Release version of STM32F3 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F3</keyword>
    <keyword>STM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32F3 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>

      <book name="Documentation/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>

      <description>
        STMicroelectronics' STM32F3 family offers an extensive range of enhanced I/Os and peripherals connected to two APB buses.

        - SRAM with HW parity checking
        - Timer with quadrature (incremental) encoder input
        - Timer with deadtime generation and emergency stop
        - 5 V-tolerant I/Os
        - Rail-to-rail analog comparators
        - Operational amplifiers
        - 96-bit unique ID
      </description>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugDeviceUnlock">
          <block>
            Sequence("CheckID");
          </block>
        </sequence>

        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
          </block>

          <block info="DbgMCU registers">
            Write32(0xE0042004, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0xE0042008, DbgMCU_APB1_Fz);                                    // DBGMCU_APB1_FZ: Configure APB1 Peripheral Freeze Behavior
            Write32(0xE004200C, DbgMCU_APB2_Fz);                                    // DBGMCU_APB2_FZ: Configure APB2 Peripheral Freeze Behavior
          </block>
        </sequence>

        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO (asynchronous) Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU (synchronous) Trace Selected?
          </block>

