armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
          <book name="Documentation/DM00133117.pdf" title="STM32F302xD STM32F302xE Datasheet"/>
          <book name="Documentation/DM00135245.pdf" title="STM32F302xD STM32F302xE Errata Sheet"/>

          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="17"      m="12"/>
          <feature type="IOs"           n="86"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>

          <variant Dvariant="STM32F302VETx">
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="STM32F302VEHx">
            <feature type="BGA" n="100"/>
          </variant>
        </device>

        <!-- **************************  Device 'STM32F302ZD'  ************************** -->
        <device Dname="STM32F302ZD">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F302xE"/>
          <debug svd="CMSIS/SVD/STM32F303xE.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_512.FLM" start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documentation/DM00133117.pdf" title="STM32F302xD STM32F302xE Datasheet"/>
          <book name="Documentation/DM00135245.pdf" title="STM32F302xD STM32F302xE Errata Sheet"/>

          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="18"      m="12"/>
          <feature type="IOs"           n="115"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>

          <variant Dvariant="STM32F302ZDTx">
            <feature type="QFP" n="144"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F302ZE'  ************************** -->
        <device Dname="STM32F302ZE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F302xE"/>
          <debug svd="CMSIS/SVD/STM32F303xE.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documentation/DM00133117.pdf" title="STM32F302xD STM32F302xE Datasheet"/>
          <book name="Documentation/DM00135245.pdf" title="STM32F302xD STM32F302xE Errata Sheet"/>

          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="18"      m="12"/>
          <feature type="IOs"           n="115"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="2"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="UART"          n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F302ZETx">
            <feature type="QFP" n="144"/>
          </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F303'  **************************** -->
      <subFamily DsubFamily="STM32F303">
        <processor Dclock="72000000"/>

        <debugvars configfile="CMSIS/Debug/STM32F303_328_358_398.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

