armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
        <!-- *************************  Device 'STM32F334C4'  ************************** -->
        <device Dname="STM32F334C4">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F334x8"/>
          <debug svd="CMSIS/SVD/STM32F334x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="2"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F334C4Tx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F334C6'  ************************** -->
        <device Dname="STM32F334C6">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F334x8"/>
          <debug svd="CMSIS/SVD/STM32F334x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="Timer"         n="1"                   name="High Resolution Timer"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F334C6Tx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F334C8'  ************************** -->
        <device Dname="STM32F334C8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F334x8"/>
          <debug svd="CMSIS/SVD/STM32F334x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="Timer"         n="1"                   name="High Resolution Timer"/>
          <feature type="ADC"           n="2"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>

          <variant Dvariant="STM32F334C8Tx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F334C8Yx">
            <feature type="CSP" n="49"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F334K4'  ************************** -->
        <device Dname="STM32F334K4">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F334x8"/>
          <debug svd="CMSIS/SVD/STM32F334x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

