armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
          <variant Dvariant="STM32F318C8Tx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F318C8Yx">
            <feature type="CSP" n="49"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F318K8'  ************************** -->
        <device Dname="STM32F318K8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F318xx"/>
          <debug svd="CMSIS/SVD/STM32F301x.svd"/>
          <debugvars configfile="CMSIS/Debug/STM32F301_318.dbgconf">
            __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
            __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
            __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
            __var TraceClk_Pin   = 0x00040002;   // PE2
            __var TraceD0_Pin    = 0x00040003;   // PE3
            __var TraceD1_Pin    = 0x00040004;   // PE4
            __var TraceD2_Pin    = 0x00040005;   // PE5
            __var TraceD3_Pin    = 0x00040006;   // PE6
          </debugvars>

          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" startup="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documentation/DM00094350.pdf" title="STM32F301x6/8 and STM32F318x8 Reference Manual"/>
          <book name="Documentation/DM00115350.pdf" title="STM32F318C8 STM32F318K8 Datasheet"/>
          <book name="Documentation/DM00115238.pdf" title="STM32F318C8 STM32F318K8 Errata Sheet"/>

          <feature type="Timer"         n="5"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="24"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F318K8Ux">
            <feature type="QFN" n="32"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F328C8'  ************************** -->
        <device Dname="STM32F328C8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F328xx"/>
          <debug svd="CMSIS/SVD/STM32F301x.svd"/>
          <debugvars configfile="CMSIS/Debug/STM32F303_328_358_398.dbgconf">
            __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
            __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
            __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
            __var TraceClk_Pin   = 0x00040002;   // PE2
            __var TraceD0_Pin    = 0x00040003;   // PE3
            __var TraceD1_Pin    = 0x00040004;   // PE4
            __var TraceD2_Pin    = 0x00040005;   // PE5
            __var TraceD3_Pin    = 0x00040006;   // PE6
          </debugvars>

          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available, not enough pins"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available, not enough pins"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" startup="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documentation/DM00043574.pdf" title="STM32F303xB/C/D/E, STM32F303x6/8, STM32F328x8, STM32F358xC, STM32F398xE Reference Manual"/>
          <book name="Documentation/DM00116561.pdf" title="STM32F328C8 Datasheet"/>
          <book name="Documentation/DM00117837.pdf" title="STM32F328C8 Errata Sheet"/>

          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="2"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F328C8Tx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F358CC'  ************************** -->
        <device Dname="STM32F358CC">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F358xx"/>
          <debug svd="CMSIS/SVD/STM32F30x.svd"/>
          <debugvars configfile="CMSIS/Debug/STM32F303_328_358_398.dbgconf">
            __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
            __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
            __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
            __var TraceClk_Pin   = 0x00040002;   // PE2
            __var TraceD0_Pin    = 0x00040003;   // PE3
            __var TraceD1_Pin    = 0x00040004;   // PE4
            __var TraceD2_Pin    = 0x00040005;   // PE5
            __var TraceD3_Pin    = 0x00040006;   // PE6
          </debugvars>

