armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="2"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="3"      m="16"/>
          <feature type="ADC"           n="1"      m="12"/>
          <feature type="IOs"           n="52"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F378RCTx">
            <feature type="QFP" n="64"/>
          </variant>
          <variant Dvariant="STM32F378RCYx">
            <feature type="CSP" n="64"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F378VC'  ************************** -->
        <device Dname="STM32F378VC">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F378xx"/>
          <debug svd="CMSIS/SVD/STM32F37x.svd"/>
          <debugvars configfile="CMSIS/Debug/STM32F37x.dbgconf">
            __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
            __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
            __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
            __var TraceClk_Pin   = 0x00040002;   // PE2
            __var TraceD0_Pin    = 0x00040003;   // PE3
            __var TraceD1_Pin    = 0x00040004;   // PE4
            __var TraceD2_Pin    = 0x00040005;   // PE5
            __var TraceD3_Pin    = 0x00040006;   // PE6
          </debugvars>

          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documentation/DM00041563.pdf" title="STM32F37xx Reference Manual"/>
          <book name="Documentation/DM00101621.pdf" title="STM32F378xx Datasheet"/>
          <book name="Documentation/DM00099952.pdf" title="STM32F378xx Errata Sheet"/>

          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="2"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="3"       m="16"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="84"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F378VCTx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F398VE'  ************************** -->
        <device Dname="STM32F398VE">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F398xx"/>
          <debug svd="CMSIS/SVD/STM32F37x.svd"/>
          <debugvars configfile="CMSIS/Debug/STM32F303_328_358_398.dbgconf">
            __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
            __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
            __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
            __var TraceClk_Pin   = 0x00040002;   // PE2
            __var TraceD0_Pin    = 0x00040003;   // PE3
            __var TraceD1_Pin    = 0x00040004;   // PE4
            __var TraceD2_Pin    = 0x00040005;   // PE5
            __var TraceD3_Pin    = 0x00040006;   // PE6
          </debugvars>

          <memory id="IROM1"                              start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_512.FLM" start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documentation/DM00043574.pdf" title="STM32F303xB/C/D/E, STM32F303x6/8, STM32F328x8, STM32F358xC, STM32F398xE Reference Manual"/>
          <book name="Documentation/DM00149412.pdf" title="STM32F398VE Datasheet"/>
          <book name="Documentation/DM00150605.pdf" title="STM32F398VE Errata Sheet"/>

          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="39"      m="12"/>
          <feature type="IOs"           n="88"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="5"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F398VETx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32F3">
      <description>STMicroelectronics STM32F3 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F3*"/>
    </condition>

