armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
    <!-- Device + CMSIS -->
    <condition id="STM32F3 CMSIS">
      <description>STMicroelectronics STM32F3 Series Device and CMSIS-Core</description>
      <require condition="STM32F3"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + STM32CubeMx -->
    <condition id="STM32F3 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F3 Series Device, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32F3"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <!--
    <condition id="STM32F301x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F301x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F301[CKR][68]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F302x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F302x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CKR][68]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F302xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F302xC Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CRV][BC]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F302xE CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F302xE Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[RVZ][DE]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F303x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F303x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CKR][68]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <condition id="STM32F303xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F303xC Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CRV][BC]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F303xE CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F303xE Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[RVZ][DE]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F373xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F373xC Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F373[CRV][8BC]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F334x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F334x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F334[CKR][468]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <!--
    <condition id="STM32F318xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F318xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F318[CK][8]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F328xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F328xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F328[C][8]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F358xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F358xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F358[CRV][C]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F378xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F378xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F378[CRV][C]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F398xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F398xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F398[V][E]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->

    <condition id="STM32F303xE CMSIS STM32CubeMX SPI">
      <description>STMicroelectronics STM32F3 Devices, CMSIS-Core, STM32CubeMX and CMSIS SPI driver</description>
      <require condition="STM32F303xE CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
    </condition>

    <condition id="STM32F303E-EVAL CMSIS STM32CubeMX SPI GLCD">
      <description>STMicroelectronics STM32F3 Devices, CMSIS-Core, STM32CubeMX and SPI GLCD</description>
      <require condition="STM32F303xE CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
      <require Cclass="Graphics Display" Cgroup="STM32303E-EVAL" Cvariant="SPI IF"/>
    </condition>

    <condition id="STM32F3 CMSIS STM32CubeMX Graphics SPI GLCD">
      <description>STMicroelectronics STM32F3 Devices, CMSIS-Core, STM32CubeMX, Graphics core and SPI GLCD</description>
      <require condition="STM32F3 CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"  Cgroup="SPI"/>
      <require Cclass="Graphics"      Cgroup="CORE"/>
      <accept  Cclass="Board Support" Cgroup="emWin LCD" Cvariant="SPI IF"/>
    </condition>

    <condition id="STM32F3 STARTUP CORTEX GPIO RCC FLASH">
      <description>STMicroelectronics STM32F3 devices, Startup and HAL CORTEX, GPIO, RCC and FLASH</description>
      <require condition="STM32F3"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="CORTEX"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="FLASH"/>
    </condition>
    <condition id="STM32F3 HAL">
      <description>STMicroelectronics STM32F3 devices and HAL </description>
      <require condition="STM32F3"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMMON"/>
    </condition>
    <condition id="STM32F3 HAL DMA">
      <description>STMicroelectronics STM32F3 Devices, HAL, and DMA peripheral</description>
      <require condition="STM32F3 HAL"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F3 HAL FMC_LL">
      <description>STMicroelectronics STM32F3 Devices, HAL, and FMC LL peripheral</description>
      <require condition="STM32F3 HAL"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="FMC"/>
    </condition>
