armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
    <condition id="STM32F3 LL">
      <description>STMicroelectronics STM32F3 devices and LL </description>
      <require condition="STM32F3"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="COMMON"/>
    </condition>
    <condition id="STM32F3 STARTUP LL UTILS RCC PWR">
      <description>STMicroelectronics STM32F3 Device and LL</description>
      <require condition="STM32F3"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>

    <condition id="STM32F3 LL FMC">
      <description>FMC LL Component requirements</description>
      <require condition="STM32F3 LL"/>
      <accept Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="NAND"/>
      <accept Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"/>
      <accept Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <accept Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCCARD"/>
    </condition>

    <!-- Device + Compiler Conditions -->
    <condition id="STM32F3xx ARMCC">
      <description>STMicroelectronics STM32F3xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F3*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F301x8 ARMCC">
      <description>STMicroelectronics STM32F301x8 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F301[CKR][68]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F302x8 ARMCC">
      <description>STMicroelectronics STM32F302x8 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CKR][68]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F302xC ARMCC">
      <description>STMicroelectronics STM32F302xC Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CRV][BC]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F302xE ARMCC">
      <description>STMicroelectronics STM32F302xE Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[RVZ][DE]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F303x8 ARMCC">
      <description>STMicroelectronics STM32F303x8 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CKR][68]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F303xC ARMCC">
      <description>STMicroelectronics STM32F303xC Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CRV][BC]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F303xE ARMCC">
      <description>STMicroelectronics STM32F303xE Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[RVZ][DE]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F373xC ARMCC">
      <description>STMicroelectronics STM32F373xC Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F373[CRV][8BC]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F334x8 ARMCC">
      <description>STMicroelectronics STM32F334x8 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F334[CKR][468]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F318xx ARMCC">
      <description>STMicroelectronics STM32F318xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F318[CK][8]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F328xx ARMCC">
      <description>STMicroelectronics STM32F328xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F328[C][8]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F358xx ARMCC">
      <description>STMicroelectronics STM32F358xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F358[CRV][C]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F378xx ARMCC">
      <description>STMicroelectronics STM32F378xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F378[CRV][C]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F398xx ARMCC">
      <description>STMicroelectronics STM32F398xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F398[V][E]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>
  </conditions>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command>
      <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir>
      <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" Capiversion="1.0.0" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>
  
