armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
      <component Cgroup="STM32Cube HAL" Csub="DMA" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>DMA controller (DMA) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_DMA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_dma.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="FLASH" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Embedded Flash memory HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_FLASH
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_flash.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_flash_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="GPIO" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>General-purpose I/O (GPIO) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_GPIO
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_gpio.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="HRTIM" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>High resolution timer (HRTIM) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_HRTIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="I2C" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Inter-integrated circuit (I2C) interface HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_I2C
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_i2c.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_i2c_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="I2S" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Interchip sound (I2S) interface HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_I2S
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_i2s.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_i2s_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="IRDA" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>IrDA HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_IRDA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_irda.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="IWDG" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Independent watchdog (IWDG) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_IWDG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_iwdg.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="NAND" Cversion="1.9.0" condition="STM32F3 HAL FMC_LL">
        <description>NAND Flash controller HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_NAND
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_nand.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="NOR" Cversion="1.9.0" condition="STM32F3 HAL FMC_LL">
        <description>NOR Flash controller HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_NOR
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_nor.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="OPAMP" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Operational amplifier (OPAMP) peripheral HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_OPAMP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_opamp.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_opamp_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="PCCARD" Cversion="1.9.0" condition="STM32F3 HAL FMC_LL">
        <description>PC Card controller HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_PCCARD
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pccard.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="PCD" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>USB Peripheral controller (PCD) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_PCD
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pcd.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pcd_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="PWR" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Power controller (PWR) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_PWR
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pwr.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pwr_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="RCC" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Reset and clock control (RCC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_RCC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_rcc.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_rcc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="RTC" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Real-time clock (RTC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_RTC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_rtc.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_rtc_ex.c"/>
        </files>
      </component>
