armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
      <component Cgroup="STM32Cube HAL" Csub="SDADC" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Sigma-Delta Analog to Digital Converter (SDADC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SDADC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_sdadc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SMARTCARD" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Smartcard HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SMARTCARD
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_smartcard.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_smartcard_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SMBUS" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>System Management Bus (SMBUS) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SMBUS
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_smbus.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SPI" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Serial peripheral interface (SPI) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SPI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_spi.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_spi_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SRAM" Cversion="1.9.0" condition="STM32F3 HAL FMC_LL">
        <description>SRAM controller (SRAM) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SRAM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_sram.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="TIM" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Timers (TIM) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_TIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_tim.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_tim_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="TSC" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Touch Sensing Controller (TSC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_TSC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_tsc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="UART" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Universal asynchronous receiver transmitter (UART) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_UART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_uart.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_uart_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="USART" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Universal synchronous asynchronous receiver transmitter (USART) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_USART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_usart.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="WWDG" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Window watchdog (WWDG) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_WWDG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_wwdg.c"/>
        </files>
      </component>

      <!-- STM32F3xx LL Drivers -->
      <component Cgroup="STM32Cube LL" Csub="COMMON" Cversion="1.9.0" condition="STM32F3 STARTUP LL UTILS RCC PWR">
        <description>Common LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_DRIVERS_USED
          #define RTE_DEVICE_LL_COMMON
        </RTE_Components_h>
        <files>
          <file category="include" name="Drivers/STM32F3xx_HAL_Driver/Inc/"/>
          <file category="include" name="Drivers/STM32F3xx_HAL_Driver/Inc/Legacy/"/>
          <file category="source"  name="MDK/Driver/stm32f3xx_ll.c"/>
          <file category="header"  name="MDK/Templates_LL/Inc/stm32_assert.h"       attr="template" select="STM32 assert template"/>
          <file category="header"  name="MDK/Templates_LL/Inc/stm32f3xx_it.h"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="source"  name="MDK/Templates_LL/Src/stm32f3xx_it.c"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="header"  name="MDK/Templates_LL/Inc/main.h"               attr="template" select="'main' module for STM32Cube"/>
          <file category="source"  name="MDK/Templates_LL/Src/main.c"               attr="template" select="'main' module for STM32Cube"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="ADC" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Analog-to-digital converter (ADC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_ADC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_adc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="COMP" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Analog Comparator (CRC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_COMP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_comp.c"/>
        </files>
      </component>
