armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
      <component Cgroup="STM32Cube LL" Csub="CRC" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>CRC calculation unit (CRC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_CRC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_crc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="DAC" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Digital-to-analog converter (DAC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_DAC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_dac.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="DMA" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>DMA controller (DMA) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_DMA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_dma.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="EXTI" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Extended interrupts and events controler (EXTI) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_EXTI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_exti.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="FMC" Cversion="1.9.0"  condition="STM32F3 LL FMC">
        <description>Flexible memory controller (FMC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_FMC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_fmc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="GPIO" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>General-purpose I/O (GPIO) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_GPIO
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_gpio.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="HRTIM" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>High resolution timer (HRTIM) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_HRTIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_hrtim.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="I2C" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Inter-integrated circuit (I2C) interface LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_I2C
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_i2c.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="OPAMP" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Operational amplifier (OPAMP) peripheral LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_OPAMP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_opamp.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="PWR" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Power controller (PWR) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_PWR
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_pwr.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="RCC"    Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Reset and clock control (RCC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_RCC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_rcc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="RTC" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Real-time clock (RTC) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_RTC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_rtc.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="SPI" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Serial peripheral interface (SPI) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_SPI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_spi.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="TIM" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Timers (TIM) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_TIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_tim.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="USART" Cversion="1.9.0"  condition="STM32F3 LL">
        <description>Universal synchronous asynchronous receiver transmitter (USART) LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_USART
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_usart.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube LL" Csub="UTILS"  Cversion="1.9.0"  condition="STM32F3 LL">
        <description>UTILS LL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_LL_UTILS
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_utils.c"/>
        </files>
      </component>
    </bundle>

    <!-- CMSIS drivers -->
    <component Cclass="CMSIS Driver" Cgroup="CAN"                          Capiversion="1.0.0" Cversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
      <description>CAN Driver for STM32F3 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/bxCAN_STM32F3xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C"                          Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
      <description>I2C Driver for STM32F3 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/I2C_STM32F3xx.c"/>
      </files>
    </component>
