armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F3xx/Keil.STM32F3xx_DFP.pdsc
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F303xC CMSIS STM32CubeMX">
        <description>LED driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32303C-EVAL/Common/LED_STM32303C-EVAL.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32303E-EVAL Board Support -->
    <bundle Cbundle="STM32303E-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32303E-EVAL Board</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F303xE CMSIS STM32CubeMX">
        <description>A/D Converter driver for STMicroelectronics STM32303E-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32303E-EVAL/Common/ADC_STM32303E-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32F303xE CMSIS STM32CubeMX">
        <description>Joystick Interface for STMicroelectronics STM32303E-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32303E-EVAL/Common/Joystick_STM32303E-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F303xE CMSIS STM32CubeMX SPI">
        <description>Graphic LCD driver for STMicroelectronics STM32303E-EVAL Board</description>
        <files>
          <file category="header"  name="MDK/Boards/ST/STM32303E-EVAL/Common/GLCD_Config.h"/>
          <file category="source"  name="MDK/Boards/ST/STM32303E-EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32303E-EVAL/Common/GLCD_SPI_STM32303E-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F303xE CMSIS STM32CubeMX">
        <description>Graphic LCD driver for STMicroelectronics STM32303E-EVAL Board</description>
        <files>
          <file category="header"  name="MDK/Boards/ST/STM32303E-EVAL/Common/GLCD_Config.h"/>
          <file category="source"  name="MDK/Boards/ST/STM32303E-EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32303E-EVAL/Common/GLCD_SPI_STM32303E-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F303xE CMSIS STM32CubeMX">
        <description>Button driver for STMicroelectronics STM32303E-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32303E-EVAL/Common/Buttons_STM32303E-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F303xE CMSIS STM32CubeMX">
        <description>LED driver for STMicroelectronics STM32303E-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32303E-EVAL/Common/LED_STM32303E-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="SPI IF" condition="STM32F303E-EVAL CMSIS STM32CubeMX SPI GLCD">
        <description>emWin LCD SPI Interface for STM32303E-EVAL  Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32303E-EVAL/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>

    <component Cclass="Graphics Display" Cgroup="STM32303E-EVAL" Cvariant="SPI IF" Cversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX Graphics SPI GLCD">
      <description>LCD Configuration for MB895/S C03 LCD for STM32303E-EVAL Board</description>
      <files>
        <file category="source" name="MDK/Boards/ST/STM32303E-EVAL/Common/LCDConf.c" attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>

  <boards>
    <board vendor="STMicroelectronics" name="STM32F3-Discovery" revision="Rev.B.0" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32F3DISCOVERY">
      <description>STMicroelectronics STM32F3-Discovery Board</description>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/PF254044" title="STM32F3-Discovery Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F303VC"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F303"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="LED"       n="10"              name="LEDs: USB COM, 3.3 V Power, 8 user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <board vendor="STMicroelectronics" name="STM32F334-Discovery" revision="Rev.B.01" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32F3348DISCOVERY">
      <description>STMicroelectronics STM32F3-Discovery Board</description>
      <book category="overview"  name="http://www.st.com/en/evaluation-tools/32f3348discovery.html" title="STM32F334-Discovery Web Page"/>
      <book category="manual"    name="Documentation/DM00108524.pdf"              title="STM32F334 User's Manual"/>
      <book category="schematic" name="Documentation/stm32f3348-disco_sch.zip"    title="STM32F334 Schematics"/>
      <book category="other"     name="Documentation/stm32f3348-disco_gerber.zip" title="STM32F334 Gerber Files"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F334C8"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F334"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="LED"       n="6"              name="LEDs: USB COM, 3.3 V Power, 4 user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <board vendor="STMicroelectronics" name="STM32373C-EVAL" revision="Rev.B" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32373C-EVAL Board</description>
      <book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF252995" title="STM32373C-EVAL Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F373VC"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F373"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

    <board vendor="STMicroelectronics" name="STM32303C-EVAL" revision="Rev.A" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32303C-EVAL Board</description>
      <book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF252996" title="STM32303C-EVAL Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F303VC"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F303"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

    <board vendor="STMicroelectronics" name="STM32303E-EVAL" revision="Rev.A" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32303E-EVAL Board</description>
      <book category="overview"  name="http://www.st.com/en/evaluation-tools/stm32303e-eval.html" title="STM32303E-EVAL Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F303VE"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F303"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="2"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="1"              name="Push-Button: Key"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- STM32F3-Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F3-Discovery/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32F3-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTOS2</category>
      </attributes>
    </example>

    <!-- STM32F334-Discovery Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F334-Discovery/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32F334-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTOS2</category>
      </attributes>
    </example>

    <!-- STM32373C-EVAL Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32373C-EVAL/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32373C-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTOS2</category>
      </attributes>
    </example>

